tap "argon/mas"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mas-cli/tap"
tap "rcmdnk/file"
brew "cmake"
brew "php"
brew "composer"
brew "coreutils"
brew "docker"
brew "dotnet"
brew "elixir"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "mas"
brew "ninja"
brew "nvm"
brew "protobuf"
brew "opencv"
brew "rust"
brew "vim"
brew "wget"
brew "rcmdnk/file/brew-file"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "bettertouchtool"
cask "cheatsheet"
cask "chrome-remote-desktop-host"
cask "cursor"
cask "discord"
cask "dropbox"
cask "firefox"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "microsoft-edge"
cask "mono-mdk-for-visual-studio"
cask "notion-calendar"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "raycast"
cask "readdle-spark"
cask "sourcetree"
cask "sublime-text"
cask "teamviewer"
cask "visual-studio-code"
cask "vivaldi"
cask "warp"
cask "zed"
vscode "1password.op-vscode"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "astro-build.astro-vscode"
vscode "batisteo.vscode-django"
vscode "bibhasdn.django-html"
vscode "bibhasdn.django-snippets"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "ckolkman.vscode-postgres"
vscode "codezombiech.gitignore"
vscode "cweijan.vscode-autohotkey-plus"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "felgo.felgo"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.vscode-mysql"
vscode "gera2ld.markmap-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "ics.japanese-proofreading"
vscode "ionide.ionide-fsharp"
vscode "ionutvmi.path-autocomplete"
vscode "jakebecker.elixir-ls"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jrebocho.vscode-random"
vscode "junstyle.php-cs-fixer"
vscode "kenhowardpdx.vscode-gist"
vscode "kevinglasson.cornflakes-linter"
vscode "magicstack.magicpython"
vscode "marabesi.php-import-checker"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "neilbrayfield.php-docblocker"
vscode "nickdemayo.vscode-json-editor"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pairprog.ui-sketcher"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "serayuzgur.crates"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "shuworks.vscode-table-formatter"
vscode "sonarsource.sonarlint-vscode"
vscode "stevencl.adddoccomments"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "tldraw-org.tldraw-vscode"
vscode "tonka3000.qtvsctools"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-concourse"
vscode "vmware.vscode-manifest-yaml"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
vscode "wraith13.bracket-lens"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zenn.zenn-preview"
vscode "zobo.php-intellisense"
